
## Plan Result

[CI link](https://github.com/Digix00/hackathon/actions/runs/23260765051)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * google_cloud_run_v2_job.worker
  * google_cloud_run_v2_service.api
  * google_cloud_run_v2_service_iam_member.noauth
  * google_secret_manager_secret.music_state_secret
  * google_secret_manager_secret.music_token_encryption_key


<details><summary>Change Result (Click me)</summary>

```hcl

  # google_cloud_run_v2_job.worker will be created
  + resource "google_cloud_run_v2_job" "worker" {
      + conditions               = (known after apply)
      + create_time              = (known after apply)
      + creator                  = (known after apply)
      + delete_time              = (known after apply)
      + deletion_protection      = false
      + effective_annotations    = (known after apply)
      + effective_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                     = (known after apply)
      + execution_count          = (known after apply)
      + expire_time              = (known after apply)
      + generation               = (known after apply)
      + id                       = (known after apply)
      + last_modifier            = (known after apply)
      + latest_created_execution = (known after apply)
      + launch_stage             = (known after apply)
      + location                 = "asia-northeast1"
      + name                     = "worker"
      + observed_generation      = (known after apply)
      + project                  = "musicswapping"
      + reconciling              = (known after apply)
      + terminal_condition       = (known after apply)
      + terraform_labels         = {
          + "goog-terraform-provisioned" = "true"
        }
      + uid                      = (known after apply)
      + update_time              = (known after apply)

      + template {
          + parallelism = (known after apply)
          + task_count  = (known after apply)

          + template {
              + execution_environment = (known after apply)
              + max_retries           = 3
              + service_account       = "worker-sa@musicswapping.iam.gserviceaccount.com"
              + timeout               = (known after apply)

              + containers {
                  + image = "asia-northeast1-docker.pkg.dev/musicswapping/app/worker:latest"

                  + env {
                      + name  = "DB_CONNECTION_NAME"
                      + value = "musicswapping:asia-northeast1:musicswapping-db"
                    }
                  + env {
                      + name  = "DB_NAME"
                      + value = "hackathon"
                    }
                  + env {
                      + name  = "DB_PASSWORD"
                        # (1 unchanged attribute hidden)

                      + value_source {
                          + secret_key_ref {
                              + secret  = "db-password"
                              + version = "latest"
                            }
                        }
                    }
                  + env {
                      + name  = "DB_USER"
                      + value = "appuser"
                    }

                  + resources {
                      + limits = {
                          + "cpu"    = "1"
                          + "memory" = "512Mi"
                        }
                    }

                  + startup_probe (known after apply)

                  + volume_mounts {
                      + mount_path = "/cloudsql"
                      + name       = "cloudsql"
                    }
                }

              + volumes {
                  + name = "cloudsql"

                  + cloud_sql_instance {
                      + instances = [
                          + "musicswapping:asia-northeast1:musicswapping-db",
                        ]
                    }
                }
            }
        }
    }

  # google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = false
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "asia-northeast1"
      + name                    = "api"
      + observed_generation     = (known after apply)
      + project                 = "musicswapping"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "cloudrun-sa@musicswapping.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "asia-northeast1-docker.pkg.dev/musicswapping/app/server:latest"

              + env {
                  + name  = "APNS_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "apns-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "APPLE_MUSIC_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "apple-music-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "DB_CONNECTION_NAME"
                  + value = "musicswapping:asia-northeast1:musicswapping-db"
                }
              + env {
                  + name  = "DB_NAME"
                  + value = "hackathon"
                }
              + env {
                  + name  = "DB_PASSWORD"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "db-password"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "DB_USER"
                  + value = "appuser"
                }
              + env {
                  + name  = "FIREBASE_PROJECT_ID"
                  + value = "musicswapping"
                }
              + env {
                  + name  = "GO_ENV"
                  + value = "production"
                }
              + env {
                  + name  = "MUSIC_STATE_SECRET"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "music-state-secret"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "MUSIC_TOKEN_ENCRYPTION_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "music-token-encryption-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "SPOTIFY_CLIENT_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "spotify-client-id"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "SPOTIFY_CLIENT_SECRET"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "spotify-client-secret"
                          + version = "latest"
                        }
                    }
                }

              + ports (known after apply)

              + resources (known after apply)

              + startup_probe (known after apply)

              + volume_mounts {
                  + mount_path = "/cloudsql"
                  + name       = "cloudsql"
                }
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + volumes {
              + name = "cloudsql"

              + cloud_sql_instance {
                  + instances = [
                      + "musicswapping:asia-northeast1:musicswapping-db",
                    ]
                }
            }
        }

      + traffic (known after apply)
    }

  # google_cloud_run_v2_service_iam_member.noauth will be created
  + resource "google_cloud_run_v2_service_iam_member" "noauth" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "asia-northeast1"
      + member   = "allUsers"
      + name     = "api"
      + project  = "musicswapping"
      + role     = "roles/run.invoker"
    }

  # google_secret_manager_secret.music_state_secret will be created
  + resource "google_secret_manager_secret" "music_state_secret" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "musicswapping"
      + secret_id             = "music-state-secret"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

  # google_secret_manager_secret.music_token_encryption_key will be created
  + resource "google_secret_manager_secret" "music_token_encryption_key" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "musicswapping"
      + secret_id             = "music-token-encryption-key"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + api_url               = (known after apply)
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":101,"Program":"tfcmt","SHA1":"fcaa6f7f2b37b73aea404598e76dbc602ad01164","Vars":{},"WorkflowName":"terraform-plan"} -->